In [15]:
from pydataset import data
import pandas as pd
import numpy as np
import os
from env import host, username, password

## Part I Below

In [16]:
#db_url_function
def get_db_url(db, env_file=os.path.exists('env.py')):
    '''
    return a formatted string containing username, password,
    host and database for connecting to the mySQL server and 
    the database indicated.
    env_file checks to see if the env.py exists in cwd
    
    '''
    if env_file:
        username, password, host = (env.username, env.password, env.host)
        return f'mysql+pymysql://{username}:{password}@{host}/{db}'
    else:
        return 'hello, you need a username and password to get in!'

In [19]:
def get_db_url(host, username, password, database):
    
    return f'mysql+pymysql://{username}:{password}@{host}/{database}'

In [4]:
query = 'SELECT * FROM employees LIMIT 10'

In [5]:
#employees database
employees_df = pd.read_sql(query, url)
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

#### Database Typos

In [6]:
#db_url_function typos
def get_db_url(db, env_file=os.path.exists('env.py')):
    '''
    return a formatted string containing username, password,
    host and database for connecting to the mySQL server and 
    the database indicated.
    env_file checks to see if the env.py exists in cwd
    
    '''
    if env_file:
        usernames, password, host = (env.username, env.password, env.host)
        return f'mysql+pymysql://{username}:{password}@{host}/{db}'
    else:
        return 'hello, you need a username and password to get in!'

// The error is "usernames" instead of "username"

In [7]:
#db_url_function typos
def get_db_url(db, env_file=os.path.exists('env.py')):
    '''
    return a formatted string containing username, password,
    host and database for connecting to the mySQL server and 
    the database indicated.
    env_file checks to see if the env.py exists in cwd
    
    '''
    if env_file:
        usernames, password, host = (env.username, env.password, env.host)
        return f'mysql+pymysql://{noether_12}:{password}@{host}/{db}'
    else:
        return 'hello, you need a username and password to get in!'

//Replaced {username} with {noether_1234}

In [8]:
url=get_db_url('employees')

NameError: name 'noether_12' is not defined

//Error messaged occured due to incorrect formating

### Two seperate DataFrames

In [ ]:
query = 'SELECT * FROM employees'

In [ ]:
#employees database
employees_df = pd.read_sql(query, url)
employees_df.head()

In [ ]:
query = '''
SELECT * 
FROM titles
'''

In [ ]:
#titles database
titles_df = pd.read_sql(query, url)
titles_df.head()

#### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [ ]:
employees_df.info()

In [ ]:
titles_df.info()

//There are 30024 rows and 6 columns in employees. 

//There are 443308 rows and 4 columns in titles.

// Yes

### Summary statistics

In [ ]:
employees_df.describe()

In [ ]:
titles_df.describe()

#### Unique Titles in Titles DataFrame.

In [ ]:
titles_df.nunique().nsmallest(1)

In [ ]:
query = '''
SELECT to_date 
FROM titles
ORDER BY to_date ASC
limit 1;
'''

In [ ]:
titles_df = pd.read_sql(query, url)

In [ ]:
titles_df

// 1985-03-01 is the oldest date.

In [ ]:
query = '''
SELECT to_date 
FROM titles
WHERE to_date <= CURDATE()
ORDER BY to_date DESC
limit 1;
'''

In [ ]:
titles_df = pd.read_sql(query, url)

In [ ]:
titles_df

// The most recent date is 2002-08-01.

## Conclusion of Part I

# Part II Below

In [ ]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

In [ ]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

In [ ]:
(users.merge(roles,                  #Right Join
            left_on='role_id', 
            right_on='id', 
            how='right', 
            indicator=True
            )
)

In [ ]:
(users.merge(roles,                  #Outer Join
            left_on='role_id', 
            right_on='id', 
            how='outer', 
            indicator=True
            )
)

In [ ]:
(users.merge(roles,                  #dropped foreign keys
            left_on='role_id', 
            right_on='id', 
            how='outer')
            )

In [ ]:
users.drop(columns=['id'], inplace=True)

In [ ]:
users

#### MPG Dataset

In [ ]:
mpg = data('mpg')

In [ ]:
mpg.shape

In [ ]:
mpg.groupby('manufacturer').describe().T

In [ ]:
mpg.nunique(axis=0).head(1) #15 manufacturers

In [ ]:
mpg_unique = mpg.nunique()  #38 models
mpg_unique['model']

In [ ]:
mpg.assign(mileage_difference = mpg.hwy-mpg.cty)       #mileage_difference

In [ ]:
mpg.assign(average_mileage = (mpg.hwy+mpg.cty)/2)    #Average_mileage

In [ ]:
mpg['trans'].unique()

In [ ]:
mpg['is_automatic']=mpg.trans.str.contains('auto')==True

In [ ]:
mpg['is_automatic'] = mpg['is_automatic'].replace({True: 'Automatic', False: 'Manual'})

In [ ]:
mpg

In [ ]:
mpg.groupby('manufacturer')['average_mileage'].agg('mean')

In [ ]:
mpg.groupby('manufacturer')['average_mileage'].agg('mean').nlargest(1)

In [ ]:
mpg.groupby('is_automatic')['average_mileage'].agg('mean')

## Conclusion of Part II

### Part III Below

In [ ]:
def get_db_url(db, env_file=os.path.exists('env.py')):
    '''
    return a formatted string containing username, password,
    host and database for connecting to the mySQL server and 
    the database indicated.
    env_file checks to see if the env.py exists in cwd
    
    '''
    if env_file:
        username, password, host = (env.username, env.password, env.host)
        return f'mysql+pymysql://{username}:{password}@{host}/{db}'
    else:
        return 'hello, you need a username and password to get in!'

In [ ]:
url=get_db_url('chipotle')

In [ ]:
query = '''
SELECT *
FROM orders;
'''

### Chipotle database

In [ ]:
#chipotle database
chipotle_df = pd.read_sql(query, url)

In [ ]:
chipotle_df.info()

In [ ]:
chipotle_df.head()

In [ ]:
chipotle_df.columns

In [ ]:
chipotle_df['item_price'] = chipotle_df.item_price.str.replace('$', '').astype(float)

In [ ]:
chipotle_df

In [ ]:
chipotle_df.groupby('item_name')['id'].count().nlargest(3)

In [ ]:
chipotle_df.groupby('item_name')['item_price'].agg('sum').nlargest(1)

In [ ]:
url_e=get_db_url('employees')

In [ ]:
query = '''
SELECT *
FROM employees;
'''

In [ ]:
employees_df = pd.read_sql(query, url_e)

In [ ]:
employees_df.head()

In [ ]:
url=get_db_url('employees')

In [ ]:
query = '''
SELECT *
FROM titles;
'''

In [ ]:
titles_df = pd.read_sql(query, url)

In [ ]:
employees_df.merge(titles_df, on='emp_no')

In [ ]:
emp_title = employees_df.merge(titles_df, on='emp_no')

In [ ]:
emp_title

In [ ]:
emp_title.groupby('title')['from_date'].agg('max')

In [17]:
cross_query = '''
SELECT t.title, d.dept_name
FROM dept_emp
JOIN titles t USING(emp_no)
JOIN departments d USING(dept_no)
WHERE t.to_date > CURDATE();
'''

In [22]:
cross_url = get_db_url(host, username, password, 'employees')

In [23]:
df_cross = pd.read_sql(cross_query, cross_url)

df_cross.head()

             title        dept_name
0  Senior Engineer      Development
1            Staff            Sales
2  Senior Engineer       Production
3  Senior Engineer       Production
4     Senior Staff  Human Resources

In [ ]:
df_cross = pd.read_sql(cross_query, cross_url)

df_cross.head()

In [24]:
df_cross.shape

(265332, 2)

In [26]:
pd.crosstab(df_cross['title'], df_cross['dept_name']).T

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,68,627,1,1790,12349,3902,241
Development,1833,15677,1,43364,1085,315,6117
Finance,0,0,1,0,10650,3199,0
Human Resources,0,0,1,0,10843,3416,0
Marketing,0,0,1,0,12371,3880,0
Production,1542,13325,1,37156,1123,349,5210
Quality Management,433,3744,1,10390,0,0,1422
Research,77,830,1,2250,10219,3206,321
Sales,0,0,1,0,32032,9967,0